app/controllers/posts_controller.rb

  def index
    @query = params[:query]
    @production_area = prefectures_and_countries

    # 最初に全投稿を取得
    @posts = Post.all
---
SELECT "posts".* FROM "posts"